---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.CreationFailures.CannotCreateSlabEdgeError
source: html/17d32793-a038-9b70-8371-e8c30ec76e36.htm
---
# Autodesk.Revit.DB.BuiltInFailures.CreationFailures.CannotCreateSlabEdgeError Property

Could not create Slab Edge. [Description]

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotCreateSlabEdgeError { get; }
```